tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
# Search tool like grep, but optimized for programmers
brew "ack"
# Weather in your terminal, with ANSI colors and Unicode symbols
brew "ansiweather"
# Graphical system information display for macOS
brew "archey"
# ASCII-art image browser and animation viewer
brew "aview"
# Client for Amazon Elastic Beanstalk web service
brew "aws-elasticbeanstalk"
# SSL/TLS cryptography library
brew "openssl"
# Library for command-line editing
brew "readline"
# General-purpose data compression with high compression ratio
brew "xz"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Arbitrary precision calculator
brew "calc"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Converts boring normal dates to fun Discordian Date
brew "ddate"
# Load/unload environment variables based on $PWD
brew "direnv"
# Distributed search & analytics engine
brew "elasticsearch@5.6", restart_service: true, link: true
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Modern replacement for 'ls'
brew "exa"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Small git utilities
brew "git-extras"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Bash and zsh history suggest box
brew "hstr"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# Spell checker and morphological analyzer
brew "hunspell"
# Tools and libraries to manipulate images in many formats
brew "imagemagick", link: false
# Tools and libraries to manipulate images in many formats
brew "imagemagick@6", link: true
# Interactive computing in Python
brew "ipython"
# Kubernetes command-line interface
brew "kubernetes-cli", link: false
# The Kubernetes package manager
brew "kubernetes-helm"
# C and C++ client library to the memcached server
brew "libmemcached"
# Rainbows and unicorns in your console!
brew "lolcat"
# GUI for vim, made for macOS
brew "macvim"
# Web and API based SMTP testing tool
brew "mailhog"
# Terminal-based visual file manager
brew "midnight-commander"
# Open source relational database management system
brew "mysql", restart_service: true
# Manage multiple Node.js versions
brew "nvm"
# Terminal multiplexer
brew "tmux"
# Process manager for Procfile-based applications and tmux
brew "overmind"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Manage compile and link flags for libraries
brew "pkg-config"
# Object-relational database system
brew "postgresql", restart_service: true
# Show ps output as a tree
brew "pstree"
# Python version management
brew "pyenv"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Provides fake name and address data
brew "rig"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Code-search similar to ack
brew "the_silver_searcher"
# Programatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Tracks most-used directories to make cd smarter
brew "z"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
cask "apppolice"
cask "brave-browser"
cask "chromedriver"
cask "cloudapp"
cask "daisydisk"
cask "discord"
cask "disk-inventory-x"
cask "firefox"
cask "flux"
cask "font-anonymouspro-nerd-font"
cask "font-anonymouspro-nerd-font-mono"
cask "font-droidsansmono-nerd-font"
cask "font-droidsansmono-nerd-font-mono"
cask "font-firamono-nerd-font"
cask "font-hack-nerd-font"
cask "font-hack-nerd-font-mono"
cask "font-inconsolata-nerd-font"
cask "font-inconsolata-nerd-font-mono"
cask "font-liberationmono-nerd-font"
cask "font-liberationmono-nerd-font-mono"
cask "font-meslo-nerd-font"
cask "font-meslo-nerd-font-mono"
cask "font-monofur-nerd-font"
cask "font-monofur-nerd-font-mono"
cask "gimp"
cask "google-chrome"
cask "google-cloud-sdk"
cask "handbrake"
cask "iterm2"
cask "java8"
cask "jdiskreport"
cask "kitty"
cask "licecap"
cask "macdown"
cask "mactex"
cask "minikube"
cask "pgadmin4"
cask "postman"
cask "rescuetime"
cask "skype"
cask "slack"
cask "sourcetree"
cask "spectacle"
cask "spotify"
cask "sublime-text"
cask "telegram"
cask "the-unarchiver"
cask "tunnelblick"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zoomus"
